if __name__ == "__main__":
    # синтаксис словника - змінна = {ключ : значення}
    question_to_output = {
        "Ваші прізвище, ім'я, по батькові? ": "Ваше ім'я",
        "Скільки Вам років? ": "Ваш вік",
        "Де Ви живете? ": "Ви живете в",
        "Де Ви навчаєтесь? ": "Ви навчаєтесь в",
        "Номер Вашої групи? ": "Номер моєї групи -",
        "Який Ваш порядковий номер у списку групи? ": "Мій порядковий номер у списку групи-",
        "Як справи? ": "Ваші справи -",
        "Як Ви себе почуваєте? ": "Ви себе почуваєте -",
        "Коли будете вдома? ": "Ви будете вдома -",
        "Яку оцінку отримали на ЗНО по українській мові? ": "По ЗНО з української мови ви отримали -",
        "Сьогодні сонячно? ": "Сьогодні -",
        "Коли нарешті карантин? ": "Карантин буде -",
        "Як звати Вашого друга? ": "Вашого друга звати -",
        "Ви думаєте вступати у магістратуру? ": "Ви вступатимете в магістратуру? -",
        "Якого кольору Ваш зошит? ": "Ваш зошит такого кольору -",
        "Який Ваш настрій сьогодні? ": "Ваш настрій -"
    }
    # змінна = {ключ: значення for ключ, значення in попередній_словник.items()}
    answers = {output: input(question) for question, output in question_to_output.items()}  # генератор словника

    # for ключ, значення in словник.items():
    for output, answer in answers.items():
        print(f"{output} {answer}")
        # print(f"стрічкові дані {змінні} ") \ якшо треба взяти шось ше раз в лапки то ставимо ''

    answers_str = answers["Номер моєї групи -"][1]

    with open("answers.txt", "w", encoding="utf-8") as f:
        f.write(answers_str)
